app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`updated_at`, `crypted_password`, `username`, `password_salt`, `persistence_token`, `email`, `created_at`) VALUES('2010-07-22 19:42:21', 'c0c8882bdca1534701e25037577e6f97ab7a2134da51a4c465b39071958ab0581a58a11658057bb99d0b7c5b7433e96ff72754a40482905aec7376b24f6076cd', 'aaa', 'vnJ7lCYXFhlJ0zs0NN6F', '07297eabebdc40a9733b662159ae19b522c51577b63129273fa6d25f29d9ca6814c85beb503106737d321209283a2cbc5d15ea32af6f7edacbfc576962b02c9b', 'a@a.com', '2010-07-22 19:42:21')